Test/Integration/Fixtures/_files/online_authorization_upserted_v2/online_authorization_upserted_v2_paypal.json

{
  "event_id": "evt-a8af595de09e4a4aa42f15703a497a49",
  "timestamp": "2018-11-14T18:37:05.597Z",
  "organization": "magento-integration-sandbox",
  "id": "aut-I0DKWYYpablCpePoWizNi4uZNxKLETn7",
  "authorization": {
    "id": "aut-I0DKWYYpablCpePoWizNi4uZNxKLETn7",
    "key": "aut-I0DKWYYpablCpePoWizNi4uZNxKLETn7",
    "merchant_of_record": "flow",
    "amount": 418.67,
    "currency": "EUR",
    "customer": {
      "name": {
        "first": "Test",
        "last": "Paypal"
      },
      "phone": "9397007431",
      "email": "test-ita@test.com"
    },
    "attributes": {},
    "result": {
      "status": "authorized"
    },
    "created_at": "2018-11-14T18:37:05.597Z",
    "method": {
      "id": "paypal",
      "type": "online",
      "name": "PayPal",
      "images": {
        "small": {
          "url": "https://flowcdn.io/util/logos/payment-methods/paypal/30/original.png",
          "width": 65,
          "height": 41
        },
        "medium": {
          "url": "https://flowcdn.io/util/logos/payment-methods/paypal/60/original.png",
          "width": 100,
          "height": 60
        },
        "large": {
          "url": "https://flowcdn.io/util/logos/payment-methods/paypal/120/original.png",
          "width": 180,
          "height": 60
        }
      },
      "regions": [
        "world"
      ]
    },
    "payment": {
      "id": "pmt-ecd15a22d68f4b528c0ccac15b21d82a"
    },
    "requested": {
      "amount": 418.67,
      "currency": "EUR"
    },
    "destination": {
      "streets": [
        "Via Nicolai 65"
      ],
      "city": "Ospitale Di Cadore",
      "province": "Belluno",
      "postal": "32010",
      "country": "ITA"
    },
    "order": {
      "number": "ord-20729677e37a48f3b77601600d2c2c11"
    },
    "base": {
      "amount": 455.77,
      "currency": "USD"
    }
  },
  "discriminator": "online_authorization_upserted_v2"
}